import { Genre } from './Genre';

const genresArray = [
  'аниме',
  'биография',
  'боевик',
  'вестерн',
  'военный',
  'детектив',
  'детский',
  'документалка',
  'драма',
  'исторический',
  'кинокомикс',
  'комедия',
  'концерт',
  'короткометражка',
  'криминал',
  'мелодрама',
  'мистика',
  'музыка',
  'мультфильм',
  'мюзикл',
  'научный',
  'нуар',
  'приключения',
  'реалити-шоу',
  'семейный',
  'спорт',
  'ток-шоу',
  'триллер',
  'ужасы',
  'фантастика',
  'фэнтези',
  'эротика',
];

function GenresWidjet() {
  return (
    <>
      {genresArray.map((val) => {
        return (
          <div className="border rounded-xs mb-1 mt-1 pb-2 pt-2" key={val}>
            <Genre genre={val} />
          </div>
        );
      })}
    </>
  );
}

export { GenresWidjet };
